app/controllers/inscricaos_controller.rb

  def confirmacao
    participante = Participante.find_by_matricula(params[:matricula])
    @inscricao = Inscricao.find_by_participante_id(participante_id)
---
SELECT * FROM `participantes` WHERE (`participantes`.`matricula` = '5313') LIMIT 1
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` = 536) LIMIT 1

  def show
    @inscricao = Inscricao.find(params[:id])
---
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 2)

  def new
    @inscricao = Inscricao.find_by_participante_id(params[:participante])
    if @inscricao.present?
      @participante = Participante.find(@inscricao.participante_id)
---
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` IS NULL) LIMIT 1
SELECT * FROM `inscricaos`
SELECT * FROM `participantes` ORDER BY nome ASC
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 600) ORDER BY nome ASC

  def edit
    @inscricao = Inscricao.find(params[:id])
---
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 1)

  def sel_participa
    @dadosparticipa = Participante.find(params[:inscricao_participante_id])
    @inscricao = Inscricao.find_by_participante_id(params[:inscricao_participante_id], :conditions => ['status = 1'])
    render :update do |page|
      page.replace_html "informacoes", :partial => 'exibe_participante'
      unless @inscricao.present?
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 525)
SELECT * FROM `inscricaos` WHERE (status = 1) AND (`inscricaos`.`participante_id` = '27') LIMIT 1
SELECT * FROM `inscricaos`
SELECT * FROM `participantes` ORDER BY nome ASC

  def create
    @inscricao = Inscricao.new(params[:inscricao])
    @inscricao.data_inscricao = Time.now
    respond_to do |format|

      if @inscricao.save
---
INSERT INTO `inscricaos` (`updated_at`, `opcao1`, `opcao2`, `participante_id`, `data_inscricao`, `created_at`, `inscrito`, `periodo_opcao1`, `periodo_opcao2`) VALUES('2012-08-08 18:14:44', 48, 51, 536, '2012-08-08 15:14:44', '2012-08-08 18:14:44', NULL, 'Matutino', 'Vespertino')

  def update
    @inscricao = Inscricao.find(params[:id])


    respond_to do |format|
      if @inscricao.update_attributes(params[:inscricao])
---
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 1)
UPDATE `inscricaos` SET `periodo_opcao1` = 'Vespertino', `periodo_opcao2` = 'Noturno', `updated_at` = '2012-08-08 17:18:21' WHERE `id` = 1

 def gera_pdf
   @search = Curso.find(params[:curso])
---
SELECT * FROM `cursos` WHERE (status = 0) ORDER BY nome ASC

 def listagem
   if params[:curso].present?
     @search = Curso.find(params[:curso][:get])
     @cursos_inscricaos = Inscricao.paginate(:all, {:page => params[:page],:per_page => 10, :include => 'cursos',:conditions => [ 'cursos.id =?', @search.id ]})
---
SELECT * FROM `cursos` WHERE (status = 0) ORDER BY nome ASC
SELECT * FROM `cursos` WHERE (`cursos`.`id` = 1)
SELECT DISTINCT `inscricaos`.id FROM `inscricaos` LEFT OUTER JOIN `cursos_inscricaos` ON `cursos_inscricaos`.inscricao_id = `inscricaos`.id LEFT OUTER JOIN `cursos` ON `cursos`.id = `cursos_inscricaos`.curso_id WHERE (cursos.id =3) LIMIT 0, 5
SELECT count(DISTINCT `inscricaos`.id) AS count_all FROM `inscricaos` LEFT OUTER JOIN `cursos_inscricaos` ON `cursos_inscricaos`.inscricao_id = `inscricaos`.id LEFT OUTER JOIN `cursos` ON `cursos`.id = `cursos_inscricaos`.curso_id WHERE (cursos.id =3)

 def por_curso
   @search = Inscricao.search(params[:search])
   if (params[:search]).present?
    @curso = @search.paginate(:all,:page=>params[:page],:per_page =>20, :order => sort_column + " " + sort_direction)
---
SELECT * FROM `inscricaos`
SELECT * FROM `inscricaos` ORDER BY id asc LIMIT 0, 20
SELECT count(*) AS count_all FROM `inscricaos`

 def estatistica
    @cursos = Curso.find(:all, :order => 'nome ASC')
    @inscricaos = Inscricao.all
---
SELECT * FROM `cursos` WHERE (status = 0) ORDER BY nome ASC
SELECT * FROM `inscricaos`

  def load_locais
    @locais = Unidade.all(:conditions => ["id in (42,43,44,45,46,47,48,49,50,51)"])
---
SELECT * FROM `unidades` WHERE (id in (42,43,44,45,46,47,48,49,50,51))

  def load_inscricaos
    @inscricaos = Inscricao.find(:all)
---
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 536)

  def load_cursos
    @cursos = Curso.find(:all, :order => 'nome ASC', :conditions => ['status = 0'])
---
SELECT * FROM `cursos` WHERE (`cursos`.`id` IN (1,10,2,3,4))

  def load_participantes
    if params[:participante].present?
      @participante = Participante.find(params[:participante], :order => 'nome ASC')
---
SELECT * FROM `participantes` ORDER BY nome ASC
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 5313)